In [ ]:
# üìä Grouping and Aggregation in Pandas

# The `groupby()` function allows you to group rows by one or more columns,  
# then apply aggregation functions like `sum()`, `mean()`, `count()`, etc.

# This is useful for summary statistics and category-based analysis.

In [1]:
import pandas as pd

data = {
    "Department": ["HR", "IT", "Finance", "IT", "HR", "Finance"],
    "Employee": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank"],
    "Salary": [50000, 60000, 70000, 65000, 52000, 72000],
    "Experience": [2, 5, 7, 4, 3, 8]
}

df = pd.DataFrame(data)
df

  Department Employee  Salary  Experience
0         HR    Alice   50000           2
1         IT      Bob   60000           5
2    Finance  Charlie   70000           7
3         IT    David   65000           4
4         HR      Eva   52000           3
5    Finance    Frank   72000           8

In [2]:
## üßÆ Group by One Column

# Group by "Department" and calculate average salary.

df.groupby("Department")["Salary"].mean()

Department
Finance    71000.0
HR         51000.0
IT         62500.0
Name: Salary, dtype: float64

In [3]:
## üß† Apply Multiple Aggregation Functions

# Use `.agg()` to apply different functions to one or more columns.

df.groupby("Department").agg({
    "Salary": ["mean", "max", "min"],
    "Experience": "sum"
})

             Salary               Experience
               mean    max    min        sum
Department
Finance     71000.0  72000  70000         15
HR          51000.0  52000  50000          5
IT          62500.0  65000  60000          9

In [4]:
## üî¢ Count Employees in Each Department
df.groupby("Department").count()["Employee"]

Department
Finance    2
HR         2
IT         2
Name: Employee, dtype: int64

In [6]:
## üîÅ Reset Index After Grouping

# To turn the group labels back into a column, use `.reset_index()`

# Exclude non-numeric columns when calculating the mean
df_grouped = df.groupby("Department")[["Salary", "Experience"]].mean().reset_index()
df_grouped

# ‚úÖ Use `groupby()` to group data by categories  
# ‚úÖ Use `.agg()` for multiple statistics  
# ‚úÖ Use `reset_index()` to flatten grouped DataFrames

  Department   Salary  Experience
0    Finance  71000.0         7.5
1         HR  51000.0         2.5
2         IT  62500.0         4.5